// Redux store
// 1) Cart items
// 2) Categories

const initialState = {
  cart: [],
  categories: [],
};

// При первоначальной загрузке, запросить данные о категориях и сохранить их в store

/*
    1. Отправим запрос на http://localhost:3333/categories/all
    2. Получим ответ
    3. Сохраним ответ в store categories
*/

// Категории - Actions
// 1. Загрузить категории

// Корзина - Actions
// 1. Добавить товар в корзину
//     - Принимает ID товара
//     - Если товар уже есть в корзине, увеличивает его количество на 1
//     - Иначе, добавляет товар в корзину в количестве 1

// 2. Уменьшить количество товара в корзине
//     - Принимает ID товара
//     - Если количество товара больше 1, уменьшает его на 1
//     - Иначе, удаляет товар из корзины

// 3. Обновить количество товара в корзине
//     - Принимает ID товара и новое количество

// 4. Удалить товар из корзины
//     - Принимает ID товара

// 5. Очистить корзину
